In [7]:
#importing the required library functions.
import numpy as np
import pandas as pd

In [8]:
#here is the original data set that we will use to train our model to predict salary based of experience, test_score, interview_score.
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [9]:
# calculating the mean of test score.
mean_value = df['test_score(out of 10)'].mean()
mean_value

7.857142857142857

In [10]:
import math
mean_value = math.floor(df['test_score(out of 10)'].mean())
mean_value

7

In [11]:
# We are using this mean_value to fill the missing value in the test score column.
df['test_score(out of 10)'].fillna(mean_value)

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     7.0
7     7.0
Name: test_score(out of 10), dtype: float64

In [12]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(mean_value)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    7.0                           7      72000
7     eleven                    7.0                           8      80000

In [13]:
# word2number package is used here to convert string number to their respective integer values.
from word2number import w2n

In [16]:
df['experience']=df['experience'].fillna('zero')
df['experience']

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [17]:
df['experience'] = df['experience'].apply(w2n.word_to_num)
df['experience']

0     0
1     0
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: int64

In [18]:
# Now our data is ready to train the model.
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [19]:
from sklearn.linear_model import LinearRegression

In [20]:
lr = LinearRegression()

In [26]:
lr.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df['salary($)'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [27]:
# Predicting the salary of a candidate having experience=2yrs, test score=9 and interview score=6
print(lr.predict([[2,9,6]]))

[53713.86677124]

In [28]:
# Predicting the salary of a candidate having experience=12yrs, test score=10 and interview score=10
print(lr.predict([[12,10,10]]))

[93747.79628651]